[
  {
    "id": 101,
    "productName": "Coca-Cola Classic",
    "type": "Soft Drink",
    "price": 1.99,
    "rating": 4.5,
    "img": "https://i.ibb.co/fYQmty2/louis-hansel-M-4-S-Ss-DFw-unsplash.jpg",
    "description": "Classic Coca-Cola is a carbonated soft drink with a distinctive and refreshing taste. It's made from carbonated water, high fructose corn syrup, caramel color, phosphoric acid, natural flavors, and caffeine."
  },
  {
    "id": 102,
    "productName": "Coca-Cola Zero",
    "type": "Soft Drink",
    "price": 1.79,
    "rating": 4.2,
    "img": "https://i.ibb.co/V3YQx7M/mahbod-akhzami-If-Xtq-n-ZOs4-unsplash.jpg",
    "description": "Coca-Cola Zero is a sugar-free and calorie-free soft drink that offers the great taste of Coca-Cola without the sugar. It's perfect for those looking for a lighter cola option."
  },
  {
    "id": 103,
    "productName": "Diet Coke",
    "type": "Soft Drink",
    "price": 1.89,
    "rating": 4.3,
    "img": "https://i.ibb.co/QXXCn53/brett-jordan-Q4-8o-T2bvw8-unsplash.jpg",
    "description": "Diet Coke is a zero-calorie soft drink that provides the same refreshing taste as regular Coca-Cola without the calories. It's ideal for those following a calorie-conscious diet."
  },
  {
    "id": 104,
    "productName": "Coca-Cola Cherry",
    "type": "Soft Drink",
    "price": 1.95,
    "rating": 4.4,
    "img": "https://i.ibb.co/yhyyJyT/download-13.jpg",
    "description": "Coca-Cola Cherry combines the classic Coca-Cola taste with a hint of cherry flavor. It offers a unique and fruity twist to the traditional cola experience."
  },
  {
    "id": 201,
    "productName": "Big Mac",
    "type": "Burger",
    "price": 4.99,
    "rating": 4.8,
    "img": "https://i.ibb.co/30GQ27p/download-9.jpg",
    "description": "The Big Mac is a classic McDonald's burger featuring two all-beef patties, special sauce, lettuce, cheese, pickles, and onions, all sandwiched between a sesame seed bun."
  },
  {
    "id": 202,
    "productName": "McChicken",
    "type": "Chicken Sandwich",
    "price": 3.49,
    "rating": 4.6,
    "img": "https://i.ibb.co/C7g78zT/download-10.jpg",
    "description": "McChicken is a flavorful chicken sandwich from McDonald's. It consists of a breaded chicken patty, lettuce, and mayonnaise, served in a soft bun."
  },
  {
    "id": 203,
    "productName": "Filet-O-Fish",
    "type": "Fish Sandwich",
    "price": 3.99,
    "rating": 4.4,
    "img": "https://i.ibb.co/MSJhFJn/download-11.jpg",
    "description": "Filet-O-Fish is a popular McDonald's fish sandwich. It features a breaded fish filet, tartar sauce, and a slice of processed cheese, all served in a bun."
  },
  {
    "id": 204,
    "productName": "McFlurry",
    "type": "Dessert",
    "price": 2.49,
    "rating": 4.7,
    "img": "https://i.ibb.co/KrvfDvH/download-12.jpg",
    "description": "McFlurry is a delightful McDonald's dessert made by blending soft-serve ice cream with various toppings and flavors. It's a perfect treat for ice cream lovers."
  },
  {
    "id": 301,
    "productName": "Caramel Macchiato",
    "type": "Coffee",
    "price": 3.49,
    "rating": 4.6,
    "img": "https://i.ibb.co/1T2STpR/download-5.jpg",
    "description": "Caramel Macchiato is a popular Starbucks coffee drink that combines espresso with steamed milk, vanilla syrup, and caramel drizzle. It offers a perfect balance of rich coffee flavor and sweetness."
  },
  {
    "id": 302,
    "productName": "Pumpkin Spice Latte",
    "type": "Coffee",
    "price": 4.29,
    "rating": 4.4,
    "img": "https://i.ibb.co/R464TNv/download-6.jpg",
    "description": "Pumpkin Spice Latte is a seasonal Starbucks coffee beverage that features espresso, steamed milk, pumpkin spice syrup, and whipped cream. It's a fall-inspired drink loved for its warm and comforting flavors."
  },
  {
    "id": 303,
    "productName": "Green Tea Frappuccino",
    "type": "Frappuccino",
    "price": 4.99,
    "rating": 4.5,
    "img": "https://i.ibb.co/dMnVnns/download-7.jpg",
    "description": "Green Tea Frappuccino is a blended beverage from Starbucks made with matcha green tea powder, milk, ice, and sweeteners. It's a refreshing and energizing choice, especially for green tea enthusiasts."
  },
  {
    "id": 304,
    "productName": "Java Chip Frappuccino",
    "type": "Frappuccino",
    "price": 5.49,
    "rating": 4.7,
    "img": "https://i.ibb.co/dBBd799/download-8.jpg",
    "description": "Java Chip Frappuccino is a decadent Starbucks drink made with coffee, milk, ice, java chips, and chocolate syrup. It's blended to perfection and topped with whipped cream, offering a delightful combination of coffee and chocolate flavors."
  },
  {
    "id": 401,
    "productName": "Pepsi",
    "type": "Soft Drink",
    "price": 1.79,
    "rating": 4.4,
    "img": "https://i.ibb.co/jWcsjgx/olena-bohovyk-XISvsv7-LR4c-unsplash.jpg",
    "description": "Pepsi is a carbonated soft drink known for its bold and refreshing taste. It's made with carbonated water, high fructose corn syrup, caramel color, phosphoric acid, natural flavors, and caffeine."
  },
  {
    "id": 402,
    "productName": "Diet Pepsi",
    "type": "Soft Drink",
    "price": 1.89,
    "rating": 4.3,
    "img": "https://i.ibb.co/HdPpMrX/andrew-george-e-X2u1-YM7b3-E-unsplash.jpg",
    "description": "Diet Pepsi is a calorie-free soft drink that offers the same refreshing taste as regular Pepsi but without the sugar. It's a great choice for those seeking a sugar-free cola option."
  },
  {
    "id": 403,
    "productName": "Pepsi Zero Sugar",
    "type": "Soft Drink",
    "price": 1.99,
    "rating": 4.2,
    "img": "https://i.ibb.co/P1qg4KD/mikael-stenberg-c-Je-GGOI8e-E0-unsplash.jpg",
    "description": "Pepsi Zero Sugar is a zero-calorie soft drink that provides the same bold taste as regular Pepsi. It's sweetened with artificial sweeteners and offers a guilt-free cola experience."
  },
  {
    "id": 404,
    "productName": "Mountain Dew",
    "type": "Soft Drink",
    "price": 1.89,
    "rating": 4.6,
    "img": "https://i.ibb.co/mDzc1pq/evenezer-marak-Kp-Tk-PUEO4-Ns-unsplash.jpg",
    "description": "Mountain Dew is a citrus-flavored carbonated soft drink known for its vibrant taste and high caffeine content. It's a favorite among fans of energetic and bold beverages."
  },
  {
    "id": 501,
    "productName": "KitKat",
    "type": "Chocolate",
    "price": 1.29,
    "rating": 4.7,
    "img": "https://i.ibb.co/FsqK2wx/matt-chris-pua-W73-Ld-E-t8-DY-unsplash.jpg",
    "description": "KitKat is a beloved chocolate bar made of layers of crisp wafer coated in smooth milk chocolate. It's known for its distinctive snap when broken into individual fingers, making it a fun and satisfying treat."
  },
  {
    "id": 502,
    "productName": "Nestlé Crunch",
    "type": "Chocolate",
    "price": 1.19,
    "rating": 4.5,
    "img": "https://i.ibb.co/6vV48XZ/download-1.png",
    "description": "Nestlé Crunch is a classic chocolate bar featuring crisped rice mixed with creamy milk chocolate. Its delightful crunch and sweet flavor make it a popular choice among chocolate enthusiasts."
  },
  {
    "id": 503,
    "productName": "Nestlé Aero",
    "type": "Chocolate",
    "price": 1.39,
    "rating": 4.6,
    "img": "https://i.ibb.co/1KddP5H/download-3.jpg",
    "description": "Nestlé Aero is a unique chocolate bar known for its airy and bubbly texture. It's made of smooth milk chocolate filled with tiny air bubbles, creating a light and melt-in-your-mouth experience."
  },
  {
    "id": 504,
    "productName": "Milkybar",
    "type": "White Chocolate",
    "price": 1.49,
    "rating": 4.8,
    "img": "https://i.ibb.co/ZcDXKrC/download-4.jpg",
    "description": "Milkybar is a creamy and indulgent white chocolate bar made with high-quality milk powder. It's loved for its sweet and milky flavor, offering a delightful alternative to traditional dark or milk chocolate."
  },
  {
    "id": 601,
    "productName": "Frosted Flakes",
    "type": "Cereal",
    "price": 2.49,
    "rating": 4.6,
    "img": "https://i.ibb.co/myfN0yJ/deepak-n-gwe4-Z-E5s-K0-unsplash.jpg",
    "description": "Frosted Flakes is a popular breakfast cereal known for its crispy corn flakes coated with sweet sugar frosting. It's a delicious and energizing way to start the day, loved by kids and adults alike."
  },
  {
    "id": 602,
    "productName": "Special K",
    "type": "Cereal",
    "price": 2.29,
    "rating": 4.4,
    "img": "https://i.ibb.co/vx5mvY9/download.png",
    "description": "Special K is a nutritious and lightly sweetened cereal made with crunchy rice and wheat flakes. It's a source of essential vitamins and minerals, making it a wholesome choice for a balanced breakfast."
  },
  {
    "id": 603,
    "productName": "Rice Krispies",
    "type": "Cereal",
    "price": 2.19,
    "rating": 4.5,
    "img": "https://i.ibb.co/rftThgQ/images.jpg",
    "description": "Rice Krispies is a classic cereal made from crisped rice grains. When milk is added, it produces the well-known 'snap, crackle, and pop' sounds. It's a simple and delightful breakfast option enjoyed by families."
  },
  {
    "id": 604,
    "productName": "Corn Flakes",
    "type": "Cereal",
    "price": 1.99,
    "rating": 4.7,
    "img": "https://i.ibb.co/BgDV4md/download-2.jpg",
    "description": "Corn Flakes is a timeless cereal made from toasted flakes of corn. It's a nutritious and low-fat breakfast choice, often served with milk and fruit for a wholesome morning meal."
  }
]
